Revit 2027 API
BuiltInFailures.GridFailures.GridEndSegmentsLengthTooShort Property
 The end segment length for a grid must be at least [Length Value]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridEndSegmentsLengthTooShort { get; }
Public Shared ReadOnly Property GridEndSegmentsLengthTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridEndSegmentsLengthTooShort {
	FailureDefinitionId^ get ();
}
static member GridEndSegmentsLengthTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GridFailures Class
Autodesk.Revit.DB Namespace